# Требуется посчитать сумму целых чисел, расположенных между числами 1 и N 
# включительно.

# Входные данные
# В единственной строке входного файла INPUT.TXT записано единственное целое число N, 
# не превышающее по абсолютной величине 10 ** 4.

# Выходные данные
# В единственную строку выходного файла OUTPUT.TXT нужно вывести одно целое число — 
# сумму чисел, расположенных между 1 и N включительно.

N = int(input("введите N: "))
sum = 0
k = 1
if  1 < N < 10 ** 4:
    for i in range(N):
        sum = sum + k
        k = k + 1
    print(sum - 1 - N)
else:
    print("перезапустите программу и введите 1 < N < 10 ** 4")