# Шеренга
# (Время: 1 сек. Память: 16 Мб Сложность: 18%)
# Петя впервые пришел на урок физкультуры в новой школе. 
# Перед началом урока ученики выстраиваются по росту, в порядке невозрастания. 
# Напишите программу, которая определит на какое место в шеренге Пете нужно встать, 
# чтобы не нарушить традицию, если заранее известен рост каждого ученика и эти 
# данные уже расположены по невозрастанию (то есть каждое следующее число не 
# больше предыдущего). Если в классе есть несколько учеников с таким же ростом, 
# как у Пети, то программа должна расположить его после них.

# Входные данные
# Первая строка входного файла INPUT.TXT содержит натуральное число 
# N (N ≤ 100) – количество учеников (не считая Петю). 
# Во второй строке записаны N натуральных чисел Ai (Ai ≤ 200) – рост учеников 
# в сантиметрах в порядке невозрастания. Третья строка содержит единственное 
# натуральное число X (X ≤ 200) – рост Пети.

# Выходные данные
# В выходной файл OUTPUT.TXT выведите единственное целое число – номер 
# Пети в шеренге учеников.

from random import randint
n = int(input("количество учеников = ")) 
if n <= 100 or 0 >= n:
    lst = [randint(1, 201) for i in range(1, n + 1)]
    for i in range(n):
        for j in range(0, n - i - 1):
            if lst[j] < lst[j + 1]:
                temp = lst[j]
                lst[j] = lst[j + 1]
                lst[j + 1] = temp
    print(lst)
    r = int(input("рост Пети = ")) 
    lst.append(r)
    h = 0
    for i in range(n + 1):
        if lst[i] == r:
            h = h + 1 
        for j in range(0, n - i):
            if lst[j] < lst[j + 1]:
                temp = lst[j]
                lst[j] = lst[j + 1]
                lst[j + 1] = temp        
    print(lst)
    print("место Пети в шеренге под номером = ", lst.index(r) + h)
else:
    print("перезапути программу, количество учеников от 0 до 100")