# В фермерском хозяйстве в Карелии выращивают чернику. Она растет на круглой грядке, 
# причем кусты высажены только по окружности. Таким образом, у каждого куста есть ровно 
# два соседних. Всего на грядке растет N кустов.

# Эти кусты обладают разной урожайностью, поэтому ко времени сбора на них выросло 
# различное число ягод – на i-ом кусте выросло ai ягод.

# В этом фермерском хозяйстве внедрена система автоматического сбора черники. 
# Эта система состоит из управляющего модуля и нескольких собирающих модулей. 
# Собирающий модуль за один заход, находясь непосредственно перед некоторым кустом, 
# собирает ягоды с этого куста и с двух соседних с ним.

# Напишите программу для нахождения максимального числа ягод, которое может собрать 
# за один заход собирающий модуль, находясь перед некоторым кустом заданной во входном 
# файле грядки.

# Входные данные
# Первая строка входного файла INPUT.TXT содержит целое число N (3 ≤ N ≤ 1000) – 
# количество кустов черники. Вторая строка содержит N целых положительных 
# чисел a1, a2, ..., aN – число ягод черники, растущее на соответствующем кусте. 
# Все ai не превосходят 1000.

# Выходные данные
# В выходной файл OUTPUT.TXT выведите ответ на задачу.

from random import randint
n = int(input("введите количество кустов = "))
lst = []
k = 1000
if n <= 1000 or 3 <= n:
    for i in range(n):
        r = randint(0, k)
        k = k - r
        lst.append(r) 
else:
    print("перезапути программу, количество кустов от 3 до 1000")
print(lst)
max = 0
h = 1
for i in range(n):
    if i == len(lst) - 1:
        h = -i
    if lst[i] + lst[i + h] + lst[i - 1] > max:
        max = lst[i] + lst[i + h] + lst[i - 1]
print(max)